In [1]:
# Section 5: Operators and the Where Cluase 
'''
After completing this section you will learn:
 * The main logical and comparison operators in SQL
 * How to use the Where clause to filter your query results using logical and comparison operators
 * How to use the where clause as part of Data Manipulation Language commands to update records in a table
 * How to use the CASE Statement which is a row level conditional function

We will then round this section off with some practical assignment questions which will give you a chance to develop 
your SQL skills and knowledge further.

'''

'\nAfter completing this section you will learn:\n * The main logical and comparison operators in SQL\n * How to use the Where clause to filter your query results using logical and comparison operators\n * How to use the where clause as part of Data Manipulation Language commands to update records in a table\n * How to use the CASE Statement which is a row level conditional function\n\nWe will then round this section off with some practical assignment questions which will give you a chance to develop \nyour SQL skills and knowledge further.\n\n'

In [3]:
# Operators and the Where clause 
'''

select * FROM eba_countries WHERE population >= 300000000 ;-- 300 miliion

select * FROM eba_countries WHERE population <= 500000 ;-- 500 thousand 

select * FROM eba_countries WHERE name = 'Argentina';
select * FROM eba_countries WHERE name = "Argentina"; --invalid

select * FROM eba_countries WHERE name like 'A%'; 
select * FROM eba_countries WHERE name like '%land';

select * FROM eba_countries WHERE name like '%G%' and population>20000000; --20 million

-- OR 
select * FROM eba_countries WHERE name = 'Argentina' or name = 'Germany' or name = 'France'; 
select * FROM eba_countries WHERE name IN ('Argentina', 'Germany' , 'France'); 

'''

'\n\nselect * FROM eba_countries WHERE population >= 300000000 ;-- 300 miliion\n\nselect * FROM eba_countries WHERE population <= 500000 ;-- 500 thousand \n\nselect * FROM eba_countries WHERE name = \'Argentina\';\nselect * FROM eba_countries WHERE name = "Argentina"; --invalid\n\nselect * FROM eba_countries WHERE name like \'A%\'; \nselect * FROM eba_countries WHERE name like \'%land\';\n\nselect * FROM eba_countries WHERE name like \'%G%\' and population>20000000; --20 million\n\n-- OR \nselect * FROM eba_countries WHERE name = \'Argentina\' or name = \'Germany\' or name = \'France\'; \nselect * FROM eba_countries WHERE name IN (\'Argentina\', \'Germany\' , \'France\'); \n\n'

In [4]:
# An Important Note About Case Sensitivity In SQL
'''
 * SQL Keywords such as SELECT, FROM and WHERE are CASE INSENSITIVE
 * Table and Column names are also CASE INSENSITIVE
 * Values contained in records are CASE SENSITIVE when they are part of most string data types including char, varchar, nchar and nvarchar

If you have a table named EMP with two string columns as below
NAME JOB
Carlos Accountant
Andrew Admin Assistant

Then the below query would be fine as the table name and column names are case insensitive

Select name, job from emp;

However, the following query would return no results as the string values are case sensitive within the records of a table
Select * from emp where name = ’CARLOS’;


You would need to amend the query so that the search condition of 'CARLOS' is changed to reflect the same case sensitivity of 
the value stored in the table (which is 'Carlos') to return a match:
Select * from emp where name = ‘Carlos’;

So remember that case sensitivity is important when referring to string values in your table

'''

"\n * SQL Keywords such as SELECT, FROM and WHERE are CASE INSENSITIVE\n * Table and Column names are also CASE INSENSITIVE\n * Values contained in records are CASE SENSITIVE when they are part of most string data types including char, varchar, nchar and nvarchar\n\nIf you have a table named EMP with two string columns as below\nNAME JOB\nCarlos Accountant\nAndrew Admin Assistant\n\nThen the below query would be fine as the table name and column names are case insensitive\n\nSelect name, job from emp;\n\nHowever, the following query would return no results as the string values are case sensitive within the records of a table\nSelect * from emp where name = ’CARLOS’;\n\n\nYou would need to amend the query so that the search condition of 'CARLOS' is changed to reflect the same case sensitivity of \nthe value stored in the table (which is 'Carlos') to return a match:\nSelect * from emp where name = ‘Carlos’;\n\nSo remember that case sensitivity is important when referring to string values in your table\n\n"

In [8]:
# Introduction & Example  to Case Statement
'''
 CASE 
   WHEN condition1 THEN result1 
   WHEN condition2 THEN result2
   WHEN condition3 THEN result3 
   WHEN conditionN THEN resultN 
   ELSE RESULT 
 END;

'''
# to remember syntax remaber if condition 
'''
 if <==> WHEN 
'''

# Example 
'''
select 
  name,
  case 
     when name like 'A%' then 1
     else 0
  end as Flag_A
FROM eba_countries;

-- 
select 
  name,
  area_km2,
  case 
     when area_km2 >500000 then 'Large'
     when area_km2>=100000 then 'Medium'
     when area_km2>=0 then 'SMALL'
     else 'OTHER'
  end as COUNTRY_SIZE_CLASS
FROM eba_countries;
'''

"\nselect \n  name,\n  case \n     when name like 'A%' then 1\n     else 0\n  end as Flag_A\nFROM eba_countries;\n\n-- \nselect \n  name,\n  area_km2,\n  case \n     when area_km2 >500000 then 'Large'\n     when area_km2>=100000 then 'Medium'\n     when area_km2>=0 then 'SMALL'\n     else 'OTHER'\n  end as COUNTRY_SIZE_CLASS\nFROM eba_countries;\n"

In [9]:
# Revisting the DML Update Command
'''
create table eba_countries_dup AS ( select * from eba_countries );
select * from eba_countries_dup;

update eba_countries_dup set POPULATION=100 where name like 'A%'
select * from eba_countries_dup where name like 'A%';

update eba_countries_dup set POPULATION=20 where name = 'Belgium';
select * from eba_countries_dup;
'''

"\ncreate table eba_countries_dup AS ( select * from eba_countries );\nselect * from eba_countries_dup;\n\nupdate eba_countries_dup set POPULATION=100 where name like 'A%'\nselect * from eba_countries_dup where name like 'A%';\n\nupdate eba_countries_dup set POPULATION=20 where name = 'Belgium';\nselect * from eba_countries_dup;\n"

In [7]:
# Assignment Questions
'''
Please attempt as many questions as you can, I will go over the solutions in the next lecture. Good luck!

(For these assignment questions we will be using the Countries Sample Dataset)

Question 1)
Filter the EBA_COUNTRIES table to retrieve records have have a population greater than or equal to 10 million and less than or equal to 20 million
select * From EBA_COUNTRIES where population >= 10000000 and population <= 20000000 ;
select * from eba_countries where population between 10000000 and 20000000;


Question 2)
Create a copy of EBA_COUNTRIES and call it EBA_COUNTRIES_COPY. Update the “United Kingdom of Great Britain and Northern Ireland” to “United Kingdom” in the name field of the new table
create table EBA_COUNTRIES_COPY AS ( select * from EBA_COUNTRIES);
update EBA_COUNTRIES_COPY set name = 'United Kingdom' where name = 'United Kingdom of Great Britain and Northern Ireland';
select * from EBA_COUNTRIES_COPY  where name like '%Kingdom';

Question 3)
Write as SQL query to retrieve only those records from EBA_COUNTRIES that are in region 10, 20 or 30
select * from EBA_COUNTRIES where region_id in (10, 20, 30)


Question 4)
Filter records to show only those countries that begin with the letter “I” and contain the letter ”d” in the EBA_COUNTRIES table
select * from EBA_COUNTRIES where name like 'I%d%';



Question 5)
Query the EBA_COUNTRIES table to return only those records that have a population greater than 200 million and create a new column that holds the value 1 for all records where REGION_ID=10 and 0 if not.
select 
 name, 
 case 
    WHEN region_id = 10 then 1
    else 0
  END as RESULT

from EBA_COUNTRIES 
where population >= 200000000;


(Remember to qualify your column reference if you are using the * wildcard)
'''